/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lliu <lliu@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/26 16:09:25 by lliu              #+#    #+#             */
/*   Updated: 2022/11/09 14:08:17 by lliu             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* 字符串s的前n个字符中查找第一次出现c的位置,返回
 * 注意但c为'\0'的时候，输出最后一位 */
#include "libft.h"

char	*ft_strchr(const char *s, int c)
{
	while (*s)
	{
		if (*s == (char)c)
			return ((char *)s);
		s++;
	}
	if (*s == (char)c && !*s)
		return (((char *)s));
	return (NULL);
}
